Revit 2024 API
DocumentChangedEventArgs Methods
The DocumentChangedEventArgs type exposes the following members.
Methods
Name | Description
Dispose |  (Inherited from RevitAPIEventArgs.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetAddedElementIds()
 Returns set of elements newly added to the document.
GetAddedElementIds(ElementFilter)
 Returns set of newly added elements that pass the filter.
GetDeletedElementIds
 Returns set of elements that were deleted from the document.
GetDocument
 Returns document associated with this event
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetModifiedElementIds()
 Returns set of elements that were modified.
GetModifiedElementIds(ElementFilter)
 Returns set of elements that were modified according to the given element filter.
GetTransactionNames
 Returns names of the transactions associated with this event
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsCancelled
 Indicates whether the event is being cancelled.
 (Inherited from RevitAPIEventArgs.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
DocumentChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace